# ЗАПИШИТЕ КОМАНДЫ ДЛЯ ПЕЧАТИ РЕЗУЛЬТАТОВ
#
print("УРОК 02")
# 
# Сложите два и 3
print("2+3 =", 2 + 3)
# Умножьте Сумму 3 и 7 на разность 150 и 12
print("(3 + 7) * (150-12)")
# Разделите предыдущий результат на 12
print("((3 + 7) * (150-12)) / 12 =", ((3 + 7) * (150 - 12)) / 12)
# Найдите остаток от деления 100 и 19
print(100%19)
# Разделите целочисленно 100 и 19
print(100//19)
# Найти и напечатать среднее арифметическое чисел 13 14 15 10 45 66 32 87 23 44 88

# Равен ли остаток от деления 4 и 3 и целочисленное деление 4 и 3

# Что больше 12 * 25 или 50 * 6

# Вывести на экран площадь, периметр и диагональ прямоугольника со сторонами 15см и 8см

# Вывести на экран температуру 100С (Цельсия) по шкале Кельвина и Фаренгейта.

# Вычислить: Средний балл ученика Васи, если по физике он получил 3, 4, 4, 4, 5, 4, 3, 4, 4, 2, 5;
# по химии пять троек, пять четверок и одну 5; по русскому языку двенадцать четвёрок
# Оформите красивый вывод результатов

# Кате дали квадратную доску c одинаковыми клетками. Сторона доски содержит нечётное число клеток.
# У Кати есть мешок с конфетами и она выкладывает на доску конфеты - по одной на каждую клетку 
# доски. Первыми она выложила две большие диагонали из угла в угол. После этого ей осталось выложить
# ещё 196 конфет.
# Какова длина стороны доски в клетках?

# Метеорологи рассказали об уровне осадков за месяц в пяти городах страны:
# Липовске, Малиновске, Нектаринске, Облепиховске и Рябиновске.
# Эти города расположены в разных климатических зонах: в горах, в лесу, на реке, в пустыне и на равнине.
# Поэтому уровень осадков сильно отличается: 9 мм, 29 мм, 37мм, 50 мм, 71 мм.
# Вот что рассказали метеорологи:
# — Город в пустыне ожидаемо получил наименьшее количество осадков, а город в лесу — наибольшее.
# — Нектаринск находится в горах.
# — В Липовске выпало осадков больше, чем в Облепиховске.
# — В Малиновске осадков оказалось больше, чем в Рябиновске, но меньше, чем в Нектаринске.
# — В Облепиховске выпало 50 мм осадков.
# — В городе в горах выпало 37 мм осадков, а в городе у реки — 29 мм.
#
# Расположите города в порядке возрастания уровня осадков.
# В качестве ответа выведите на печать строки с названиями городов и
# осадками в них в порядке возрастания.



